Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: བྱང་ཤར་གྱི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ཐམས་ཅད་རབ་ཏུ་འབར་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་དམིགས་པའི་སྤྱན་རྣམ་པར་དམིགས་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པ་མེད་པར་ཤིན་ཏུ་སྤྲུལ་བ་ལ་སྩོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Anilambha­cakṣurvairocana in the northeastern world realm called Sarva­ratna­rucirā.

source: ཤར་ལྷོའི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཀྱི་འོད་ཟེར་རབ་ཏུ་སྣང་བ་ན།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Gandhapradīpa in the southeastern world realm called Gandhārciḥ­prabhā­svarā.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོས་ཀྱི་མར་མེ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞི་ཐ་དད་པའི་དཔལ་གྱི་རྒྱལ་པོ་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་། །
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Sarva­dharma­dhātu­tala­bheda­ketu­rāja.

source: ལྷོ་ནུབ་ཀྱི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཉི་མའི་འོད་གཟེར་ལྟར་སྣང་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྒོ་ཀུན་ནས་ཡེ་ཤེས་རྣམ་པར་སྣང་བའི་དབྱངས་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་མེ་ཏོག་གི་འོད་ཀུན་ནས་འཕྲོ་བར་གཙུག་ཕུད་རབ་ཏུ་འཕྱང་བ་ལ་སོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Samanta­mukha­jñāna­virocana­ghoṣa in the southwestern world realm called Sūrya­kesara­nirbhāsā.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Samanta­kusumārciḥ­pralamba­cūḍa.

source: ནུབ་བྱང་གི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཀྱི་རྒྱན་ཡིད་དུ་འོང་བའི་དགེ་བའི་སྙིང་པོ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་རྒྱ་མཚོ་ཚད་མེད་པའི་འོད་ཅེས་བྱ་བ། བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཀྱི་འོད་ཟེར་ཐོགས་པ་མེད་པའི་གཟི་བརྗིད་རྒྱལ་པོ་བློ་གྲོས་ལ་སྩོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Apramāṇa­guṇa­sāgara­prabha in the northwestern world realm called Gandhālaṃkāra­rucira­śubha­garbhā.

source: འོག་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་སེང་གེ་སྣང་ཞིང་འབར་བ་ན།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Dharma­dhātu­vidyotita­raśmi in the world realm below called Ratna­siṃhāvabhāsa­jvalanā.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་ཟེར་ཆོས་ཀྱི་དབྱིངས་སུ་སྣང་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་འོད་འཕྲོ་ཞིང་རྣམ་པར་སྣང་བར་བྱུང་བའི་བློ་གྲོས་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་། །
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Dharma­dhātvarcirvairocana­saṃbhava­mati.

source: སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་མཚན་གྱི་འོད་རྣམ་པར་སྣང་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་གྲགས་པ་ཐོགས་པ་མེད་པའི་རྣམ་པར་ཐར་པའི་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་སྟོབས་དང་། བརྩོན་འགྲུས་ཐོགས་པ་མེད་པའི་བློ་གྲོས་ལ་སོགས་པ། །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་། །
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Apratihata­guṇa­kīrti­vimokṣa­prabha­rāja in the world realm above called Akṣaṇa­rucira­vairocanā.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་འདི་དག་ལ་སོགས་པ།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Asaṅga­bala­vīrya­mati.

source: ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས། སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཐོང་ཡང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་འདིར་མི་བྱོན། ཁོ་བོ་ཡང་དེར་འགྲོ་བ་མེད་དེ་ནམ་འདོད་པ་དེ་ན་བདེ་བ་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་འོད་སྣང་མཐའ་ཡས་པ་བཞུགས་པ་འང་མཐོང་ངོ་། །
en: “Noble one, in that way, in addition to these ten tathāgatas, I see in the ten directions tathāgata arhat samyak­saṃbuddhas as numerous as the atoms in the buddha realms in the ten directions, but those tathāgatas have not come here and I have not gone there.

source: ཙན་དན་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་འོད་སྣང་རྡོ་རྗེ་བཞུགས་པའང་མཐོང་ངོ་། །སྤོས་དྲི་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་འོད་སྣང་རིན་ཆེན་བཞུགས་པ་ཡང་མཐོང་ངོ་། །པད་མོ་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་འོད་སྣང་རིན་ཆེན་པད་མོ་བཞུགས་པའང་མཐོང་ངོ་། །གསེར་ཡོད་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་འོད་སྣང་ཞི་བ་བཞུགས་པའང་མཐོང་ངོ་། །
en: “When I wish to, I see the Tathāgata Amitābha in the buddha realm Sukhāvatī, I see the Tathāgata Vajrābha in the buddha realm Candana­vatī, I see the Tathāgata Ratnābha in the buddha realm Gandhavatī, I see the Tathāgata Ratnapadmābha in the buddha realm Padmavatī, I see the Tathāgata Śantābha in the buddha realm Kanaka­vatī, I see the Tathāgata Akṣobhya in the buddha realm Abhiratī, I see the Tathāgata Siṃha in the buddha realm Supratiṣṭhā, I see the Tathāgata Candra­buddhi in the buddha realm Ādarśa­maṇḍala­nibhāsā, and I see the Tathāgata Vairocana in the buddha realm Ratna­śrī­haṃsa­citrā.

source: མངོན་པར་དགའ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་མི་སྒུལ་བ་བཞུགས་པའང་མཐོང་ངོ་། །ཤིན་ཏུ་བརྟན་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་སེང་གེ་བཞུགས་པའང་མཐོང་ངོ་། །མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟར་སྣང་བའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་ཟླ་བ་བཞུགས་པ་ཡང་མཐོང་ངོ་། །རིན་ཆེན་དཔལ་གྱི་དད་པས་བརྒྱན་པའི་འཇིག་རྟེན་གྱི་ཁམས་ན་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་བཞུགས་པ་ཡང་མཐོང་ངོ་། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོས་ནི་ཕྱོགས་གང་དང་གང་ན་འཇིག་རྟེན་གྱི་ཁམས་གང་དང་གང་གིས་དེ་བཞིན་གཤེགས་པ་གང་དང་གང་མཐོང་བར་འདོད་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དང་དེ་དག་ཀྱང་མཐོང་ངོ་། །
en: “Noble one, in that way, I see whatever tathāgata I wish to, in whatever direction, in whatever world realm.

source: དུས་གང་དང་གང་དུ་དམིགས་པ་གང་དང་གང་ལ་སྔོན་གྱི་སྤྱོད་པ་གང་དང་གང་གིས་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འདོད་པ་དང་།
en: I see whatever tathāgata I wish to, in whatever time, in whatever location, in whatever past conduct.

source: རྣམ་པར་འཕྲུལ་པ་གང་དང་གང་གི་དོན་དང་། སེམས་ཅན་འདུལ་བ་གང་དང་གང་གི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་གང་དང་གང་མཐོང་བར་འདོད་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དང་དེ་དག་ཀྱང་མཐོང་སྟེ།
en: I see whatever tathāgata I wish to, wherever he is accomplishing miracles or wherever he is guiding beings.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་འདིར་གཤེགས་པ་མ་ཡིན། བདག་ཀྱང་དེར་ཕྱིན་པ་མ་ཡིན་ནོ། །
en: And those tathāgatas have not come here, nor have I gone there.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོས་དེ་བཞིན་གཤེགས་པ་རྣམས་ག་ལས་ཀྱང་བྱོན་པ་མེད་པར་ཤེས་ལ།
en: “Noble one, in that way, I know that the tathāgatas have not come from anywhere.

source: རང་གི་ལུས་ཀྱང་གར་ཡང་འགྲོ་བ་མེད་པར་ཤེས་པ་དང་།
en: I know my own body has not gone anywhere.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་རྣམ་པར་དམྱིགས་པ་ཡང་རྨི་ལམ་ལྟ་བུར་ཤེས་ལ། རང་གི་སེམས་རྣམ་པར་དམིགས་པ་ཡང་རྨི་ལམ་དང་འདྲ་བར་རྒྱུ་བར་ཤེས་པ་དང་།
en: I know that perceiving the tathāgatas is like a dream, and I know that perceiving the activity of my own mind is like having a dream.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་རྣམ་པར་དམྱིགས་པ་ཡང་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་ལ་རང་གི་སེམས་རྣམ་པར་དམྱིགས་པ་ཡང་ཆུའི་སྣོད་གསལ་བ་ལྟ་བུར་ཤེས་པ་དང་།
en: I know that the perception of the tathāgatas is like a reflection, and I know that my own mind’s perception is like a bowl of clear water.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་རྣམ་པར་དམིགས་པ་ཡང་སྒྱུ་མས་བྱས་པའི་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་ལ་རང་གི་སེམས་རྣམ་པར་དམྱིགས་པ་ཡང་སྒྱུ་མ་ལྟ་བུར་ཤེས་པ་དང་།
en: I know that the perception of the tathāgatas is like that of forms created by a magical illusion, and I know that my own mind’s perception is like a magical illusion.

source: དེ་བཞིན་གཤེགས་པའི་གསུང་ཡང་སྒྲ་བརྙན་རིའི་བྲག་ཆ་ལྟ་བུར་བརྗོད་པར་ཤེས་ལ་རང་གི་སེམས་རྣམ་པར་དམྱིགས་པ་ཡང་སྒྲ་བརྙན་ལྟ་བུར་ཤེས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ནི་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་ལས་འབྱུང་ངོ་། །
en: I know that the speech of the tathāgatas is like echoes that sound in the mountains, and I know that my own mind’s perception is like an echo.

source: ཞེས་བྱ་བར་རྗེས་སུ་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: “It is thus that I understand, thus that I know that the entire Buddhadharma of the bodhisattvas arises from the blessing of one’s own mind.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཐམས་ཅད་ཀྱང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: All the pure buddha realms are the blessing of one’s own mind.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: The bodhisattva conduct also is the blessing of one’s own mind.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: The ripening and guidance of all beings is the blessing of one’s own mind.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: The fulfillment of the aspirations of the bodhisattvas is the blessing of one’s own mind.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་ཁྱེར་དུ་ཕྱིན་པར་བྱ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: Arriving at the city of omniscience is the blessing of one’s own mind.

source: རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པས་རྣམ་པར་རྩེ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: Delighting in inconceivable liberations is the blessing of one’s own mind.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: At attainment, the enlightenment of buddhahood is the blessing of one’s own mind.

source: ཆོས་ཀྱི་དབྱིངས་ཀུན་ནས་འདུས་པར་ཁྱུ་མཆོག་གི་མཐུ་དབྱུང་ཞིང་རྣམ་པར་འཕྲུལ་པ་ཡང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །
en: The miraculous manifestation of the powerful majesty of uniting the entire realm of phenomena is the blessing of one’s own mind.

source: བསྐལ་པ་ཐམས་ཅད་ཤིན་ཏུ་ཕྲ་བར་བསྡུ་བའི་ཡེ་ཤེས་ཀྱང་རང་གི་སེམས་ཀྱི་བྱིན་གྱི་རླབས་སོ། །ཞེས་བྱ་བར་ཁོང་དུ་ཆུད་ཅིང་རྗེས་སུ་རྟོགས་སོ། །རིགས་ཀྱི་བུ་དེ་ལ་ཁོ་བོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The wisdom that unites all kalpas into a brief time is the blessing of one’s own mind.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་ནི་རང་གི་སེམས་ཉིད་ཉེ་བར་བརྟན་པར་བྱའོ། །ཆོས་ཀྱི་སྤྲིན་གྱིས་ནི་རང་གི་སེམས་ཉིད་ཡོངས་སུ་བརླན་པར་བྱའོ། །སྒྲིབ་པའི་ཆོས་རྣམས་ལས་ནི་རང་གི་སེམས་ཉིད་ཡོངས་སུ་སྦྱང་བར་བྱའོ། །བརྩོན་འགྲུས་ཀྱིས་ནི་རང་གི་སེམས་ཉིད་བརྟན་པར་བྱའོ། །བཟོད་པས་ནི་རང་གི་སེམས་ཉིད་མཉམ་པར་བྱའོ། །ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་ནི་རང་གི་སེམས་ཉིད་གཞོལ་བར་བྱའོ། །ཤེས་རབ་ཀྱིས་ནི་རང་གི་སེམས་ཉིད་ཡོངས་སུ་སྦྱང་བར་བྱའོ། །དབང་རྣམས་ལ་ནི་རང་གི་སེམས་ཉིད་མངོན་པར་བསྒྲུབ་པར་བྱའོ། །སངས་རྒྱས་དང་མཉམ་པ་ཉིད་ལ་ནི་རང་གི་སེམས་ཉིད་རྒྱས་པར་བྱའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུས་ནི་རང་གི་སེམས་ཉིད་སྣང་བར་བྱའོ་སྙམ་མོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་རྒྱན་འདི་ཤེས་ཏེ། བླངས་ཤིང་ཡོངས་སུ་འཛིན་པར་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཆགས་པ་མེད་པའི་སེམས་དང་ལྡན་པ་ཆགས་པ་མེད་པ་རྣམ་པར་སྤྱོད་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ།
en: “Noble one, this is what I think: one’s own mind should be supported by all roots of merit, one’s own mind should be moistened by the clouds of the Dharma, one’s own mind should be purified of obscuring phenomena, one’s own mind should be made firm by diligence, one’s own mind should be made tranquil by patience, one’s own mind should be cultivated by the comprehension of knowledge, one’s own mind should be refined by wisdom, one’s own mind should have accomplishment in power, one’s own mind should be made vast in the equality of the buddhas, and one’s own mind should be illuminated by the ten strengths of the tathāgatas.

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་མངོན་སུམ་དུ་བཞུགས་པའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ། མྱ་ངན་ལས་འདའ་བ་མྱེད་པའི་མཐའ་ལ་གནས་པའི་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྒོའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པ། དུས་གསུམ་མཉམ་པ་ཉིད་དུ་གྱུར་པ། གཞི་ཀུན་ནས་ཕྱེད་པའི་ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་ཚུལ་ཤེས་པ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ལུས་རྣམ་པར་བཀྲམ་པ། སངས་རྒྱས་ཀྱི་ཡུལ་ཐ་མྱི་དད་པ་ལ་རྣམ་པར་སྤྱོད་པ།
en: “Noble one, I know, have adopted, and keep this liberation called the unimpeded display of the tathāgatas, but how could I know or describe the qualities of dwelling without impediment in the field of activity of the unimpeded minds of the bodhisattvas; the attainment of the samādhi of the direct perception of all the buddhas in the present; the attainment of the samādhi gateway to the enlightenment that has reached the apex that is without passing into nirvāṇa; the attainment of the sameness of the three times; the knowledge of the way of the field of activity of the samādhi of the completely undivided basis; the bodies distributed throughout all buddha realms; the presence in the indivisible ranges of the buddhas; the field of activity that is oriented toward all directions; the view of the domain of undivided wisdom; and the conduct that is free of the dualistic conceptions of self and world, even though in their bodies there appears the destruction and creation of all world realms?

source: ཕྱོགས་ཐམས་ཅད་དུ་མངོན་པར་ཕྱོགས་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ། ཕྱིན་ཕྱོགས་མེད་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་རྣམ་པར་ལྟ་བ་དེ་དག་གི་ལུས་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་འཇིག་ཅིང་འདུ་བར་སྣང་ཡང་དེ་དག་ལ་བདག་དང་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཉིས་ཀྱི་འདུ་ཤེས་མེད་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Now depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་འཛམ་བུའི་གླིང་གི་མགོ་འགེབས་པས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: On this road to the south, at the tip of Jambudvīpa, there is Milaspharaṇa.

source: དེ་ན་དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ཅེས་བྱ་བ་འདུག་གིས།
en: There dwells a bhikṣu by the name of Sāgara­dhvaja.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཚོང་དཔོན་བཏང་བརྗོད་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་ཡོན་ཏན་གྲངས་མེད་པ་ལ་སྙན་པར་བརྗོད་དེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct?

source: བརྟག་པ་དང་། མོས་པར་བྱ་བ་དང་།
en: How should a bodhisattva proceed?’ ”

source: མི་བཏང་བར་བྱ་བ་སེམས་ཤིང་དུ་སྟེ་སྨྲེ་སྔགས་བཏོན་ནས། དགེ་བའི་བཤེས་གཉེན་སྡུག་པར་སེམས་ཤིང་དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བར་མོས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྒོ་བ་དང་། མྱི་འགལ་བར་བྱེད་པ་དང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལུས་པར་རྗེས་སུ་བལྟ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རྗེས་སུ་བསམ་པ་དང་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the head merchant Muktaka, circumambulated the head merchant Muktaka a hundred thousand times, keeping him to his right, and, looking back again and again, beautifully describing, examining, and aspiring to the countless qualities of the head merchant Muktaka, thinking of Muktaka, he was weeping and wailing as he departed from head merchant Muktaka; he was thinking of kalyāṇamitras with affection, trusting in them, longing to honor the kalyāṇamitras, maintaining obedience to the instructions of kalyāṇamitras, and seeing omniscience as dependent upon the kalyāṇamitras; his thoughts focused on the kalyāṇamitras, his conduct faithful to the kalyāṇamitras, and being in the power of the minds of the kalyāṇamitras, by avoiding anything that would be harmful to the kalyāṇamitras he regarded them as his mother and, by developing all the qualities of roots of merit, regarded them as his father.

source: དགེ་བའི་བཤེས་གཉེན་ལ་གཡོ་སྒྱུ་མེད་པར་སྤྱོད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་སེམས་ཀྱི་དབང་དུ་འགྲོ་བར་བྱ་བ་དང་ལྡན་པས་དགེ་བའི་བཤེས་གཉེན་རྣམས་གནོད་པ་ཐམས་ཅད་ཡོངས་སུ་སྤོང་བར་བྱེད་པས་མ་ཙམ་དུ་སེམས། དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྐྱེད་པས་ཕ་ཙམ་དུ་སེམས་ཤིང་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱིས་བསྟན་པ་དེ་ལ་རྗེས་སུ་སེམས་ཤིང་། ཚོང་དཔོན་བཏང་བརྗོད་ཀྱི་གདམས་ངག་ལ་ནན་ཏན་བྱ་བ་དང་།
en: Sāgara­dhvaja Chapter 9 Sudhana, the head merchant’s son, contemplated the teaching of the head merchant Muktaka and dedicated himself to the instructions of the head merchant Muktaka.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་།
en: He followed the inconceivable bodhisattva liberations.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་།
en: He called to mind the inconceivable radiance of bodhisattva wisdom.

source: ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་ཅིང་འབབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་།
en: He practiced entering and comprehending the inconceivable realm of the Dharma.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་འདུ་བར་བྱ་བའི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པར་བྱ་བ་དང་།
en: He comprehended the inconceivable bodhisattva methods of gathering pupils.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྗེས་སུ་བལྟ་བར་བྱ་བ་དང་།
en: He reflected on the inconceivable miracles of the tathāgatas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་བསྡུ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མོས་པར་བྱ་བ་དང་།
en: He aspired to the inconceivable aggregation of buddha realms.

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་རྒྱན་རྗེས་སུ་སྦྱང་བ་དང་།
en: He contemplated the display of the blessings of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པའི་རྣམ་པར་དགོད་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་ཡོངས་སུ་བརྟག་པ་དང་།
en: He examined the inconceivable majestic power of the display of samādhis and liberations.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐ་དད་པ་ལ་སྒྲིབ་པ་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་འཇུག་པ་དང་།
en: He was dedicated to entering inconceivable separate, unobscured world realms.

source: བྱང་ཆུབ་སེམས་དཔའི་ལས་ལ་བསམ་པ་ཤིན་ཏུ་བརྟན་པ་དེ་ལ་ནན་དུ་བྱ་བ་དང་།
en: He developed the aspiration for inconceivable, enduring bodhisattva activity.

source: བྱང་ཆུབ་སེམས་དཔའི་ལས་དང་།
en: And he adopted the inconceivable continuum of bodhisattva activity and prayer.

source: སྨོན་ལམ་གྱི་རྒྱུད་བསམ་གྱིས་མི་ཁྱབ་པ་དེའི་རྗེས་སུ་སྤྱོད་ཅིང་མཐར་གྱིས་འཛམ་བུ་གླིང་གི་མགོ་འགེབས་པས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བ་གང་ན་བ་དེར་ཕྱིན་ནས།
en: Eventually he reached Milaspharaṇa at the tip of Jambudvīpa.

source: དགེ་སློང་རྒྱ་མཚོའི་རྒྱལ་མཚན་ཚོལ་ཚོལ་བ་ལས།
en: He searched and searched for the bhikṣu Sāgara­dhvaja.

source: འཆག་པའི་གནས་ཤིག་གི་འཆག་པའི་མཐར་འདུག་སྟེ།
en: Sudhana saw him sitting at the end of a meditation walkway.

source: ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་ནས་དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་མེད་ཅིང་མྱི་གཡོ་ལ་བྱེད་པ་མེད་ཅིང་ལུས་དྲང་པོར་བསྲང་སྟེ།
en: He was resting in samādhi with no inhalation or exhalation of breath, unmoving, inactive, sitting with his body upright, and manifesting mindfulness.

source: དྲན་པ་མངོན་དུ་བྱས་ནས་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མྱི་ཁྱབ་པར་རྣམ་པར་འཕྲུལ་ཞིང་གཡས་གཡོན་དང་། སྟེང་ལོགས་སུ་ལུས་མཐའ་ཡས་ལ་ཚད་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་པ་སྤྱི་གཙུག་བལྟར་མི་མཐོང་བ།
en: With the inconceivable miraculous powers of samādhi, he miraculously manifested an inconceivable, immeasurable, infinite body to the right, left, and above, so that the crown of his head was beyond sight.

source: ཁ་དོག་དུ་མའི་ལུས་དང་ལྡན་པ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཁ་དོག་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པ་ཡོངས་སུ་སྟོན་པ་དེ།
en: His body had many colors, manifesting countless different colors in each instant of the mind.

source: དེ་དེ་ལྟར་མཉམ་པར་བཞག་ཅིང་ཟབ་ལ་ཞི་སྟེ། གཡོ་བ་མེད་ཅིང་དམིགས་པ་མེད་ལ་དགའ་བས་ལུས་མཐོ་བར་གྱུར་པ་དེའི་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་འགྱེད་པར་བྱེད་ཅིང་འདུག་པ་མཐོང་ངོ་། །རྣམ་པར་ཐར་པས་རྣམ་པར་འཕྲུལ་པ་དེའི་མཐུས་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པ་སྦྱར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་དང་།
en: Sudhana saw that as Sāgara­dhvaja rested in that way in a profound, peaceful, motionless, objectless meditation, from all the pores of his body, which had become tall through joy, countless miraculous manifestations of bodhisattva liberation appeared.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་རྣམ་པར་བཟློག་པ་དང་། ངན་སོང་གི་ལམ་ཐམས་ཅད་ཡོངས་སུ་གཅད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བའི་ལམ་གྱི་སྒོ་དབྱེ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་ཤེས་པའི་སྒྲིབ་པ་རྣམ་པར་གཏོར་བ་དང་།
en: In every single instant of mind, those miraculous manifestations from the gateway of liberation spread throughout the realm of phenomena, in order that those infinite miraculous manifestations would ripen all beings, make offerings to all the tathāgatas, purify all buddha realms, eliminate the mass of suffering of all beings, close all the paths to the lower existences, open the paths to happiness for all beings, end the affliction of the kleśas for all beings, disperse the obscuration of ignorance in all beings, and establish all beings in omniscience.

source: སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དགོད་པའི་ཕྱིར་རྣམ་པར་འཕྲུལ་པའི་བྱེ་བྲག་རྣམ་པ་སྣ་ཚོགས་མཐའ་ཡས་པས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་ཤིང་དེའི་རྐང་པའི་མཐིལ་གཉིས་ནས།
en: Sudhana saw assemblies of head merchants, as numerous as the atoms in countless buddha realms, being emanated from the soles of Sāgara­dhvaja’s feet.

source: ཚོང་དཔོན་གྱི་ཚོགས་བཀུར་སྟི་དང་། རིམ་གྲོ་སྣ་ཚོགས་བྱེད་པ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་གཏོགས་པའི་ཚོང་དཔོན་དང་འདྲ་བའི་གཟུགས་དང་ལྡན་པ་ལྷག་པའི་ཡུལ་ལ་སྤྱོད་པ། རྒྱན་སྣ་ཚོགས་ཀྱིས་ལུས་ཤིན་ཏུ་ཀླུབས་པ། ཐོར་ཚུགས་དང་གཙུག་གི་རིན་པོ་ཆེ་དང་། ཅོད་པན་སྣ་ཚོགས་ཐོགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱིས་པ་བྱེ་བ་འཕྱེས་པའི་འཁོར་དང་ལྡན་པ་བྱུང་བ་མཐོང་ངོ་། །
en: They attended and waited on him in various ways, and, appearing to be all the head merchants from all world realms, forming an exceptional field of activity, their bodies were adorned by a variety of ornaments with various kinds of topknots, crest jewels, and crowns, and they were accompanied by the images of entourages of their children.

source: བྲམ་ཟེ་དང་ཁྱིམ་བདག་མང་པོའི་བཟའ་བཏུང་རྣམ་པ་མང་པོ་དང་། རོའི་ཡན་ལག་སྣ་ཚོགས་སུ་སྦྱར་བ་ཐམས་ཅད་དང་། རྒྱན་ཐམས་ཅད་དང་། གོས་ཐམས་ཅད་དང་། མེ་ཏོག་ཐམས་ཅད་དང་། ཕྲེང་བ་ཐམས་ཅད་དང་། སྤོས་ཐམས་ཅད་དང་། བྱུག་པ་ཐམས་ཅད་དང་། འདོད་པའི་ཡོད་བྱད་ཐམས་ཅད་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་དང་། གནས་ཐམས་ཅད་དང་། སྣོད་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་དང་། ཡོ་བྱད་རྣམ་པ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་དབུལ་པོ་རྣམས་ཡོངས་སུ་སྡུད་ཅིང་།
en: Sudhana also saw attending brahmins and householders, each with different kinds of food and drink with combinations of various flavors, all adornments, all clothes, all flowers, all garlands, all perfumes, all ointments, all desirable things, all jewels, all seats, all vessels of various kinds, and all kinds of utensils.

source: འགྲོ་བ་སྡུག་བསྔལ་བ་རྣམས་དབུགས་དབྱུང་བ་དང་། སེམས་ཅན་གྱི་སེམས་ཚིམ་པར་བྱ་བ་དང་། སེམས་ཅན་གྱི་བསམ་པ་རྣམ་པར་དག་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་ཕྱོགས་བཅུ་བཀང་སྟེ། འདོང་བ་མཐོང་ངོ་། །པུས་མོའི་ལྷ་ང་གཉིས་ན་རྒྱལ་རིགས་མཁས་པའི་གཟུགས་དང་། བྲམ་ཟེ་མཁས་པའི་གཟུགས་དང་། འཇིག་རྟེན་ན་མཁས་པའི་གཟུགས་དང་། བཟོ་སྣ་ཚོགས་ལ་མཁས་པའི་གཟུགས་དང་། མིའི་འགྲོ་བའི་རྒྱུད་ན་མཁས་པའི་གཟུགས་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ལས་ཀྱི་ཚུལ་དང་།
en: They were emanated out into the ten directions, where they were gathering poor people and relieving beings of their suffering, purifying the thoughts of beings, satisfying the minds of beings, and ripening beings for enlightenment.
